{
  "bgImage": "https://images.unsplash.com/photo-1642295406180-ac795877b533?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1094&q=80",
  "name": "Hamza Mehmood",
  "email": "Email | hamzameh122@gmail.com",
  "address": "",
  "city": "Abu dhabi",
  "country": "UAE",
  "phone": "Phone | +923455293564 | +971562737710",
  "description": "MERN stack developer, working as a Software Engineer at Techvista Systems",
  "profileImage": "https://media.licdn.com/dms/image/C4D03AQF1F6OPm1EQag/profile-displayphoto-shrink_400_400/0/1520105306337?e=1686787200&v=beta&t=kbL0IzX2BJLIKAPUYi5Umu-a90LRWTR1pyb6_vI0Vxg",
  "links": {
    "facebook": "#",
    "instagram": "#",
    "linkedin": "https://www.linkedin.com/in/hamzameh",
    "github": "https://github.com/dork7"
  },
  "_aboutMe": "Developer with 5 years experience in developing PWA . Interested in the job where I can learn new technology stacks and enhance my skill set",
  "aboutMe": "Full Stack Developer with 5 years experience in commercial application development. I’m focused, committed and capable of learning new technology stacks.",
  "resumeLink": "https://docs.google.com/document/d/10TQW5DFaCBblLXA0mmYlnJmzKexGyATfWRC6IUorYS4",
  "education": [
    {
      "title": "University",
      "degree": "Bachelors in Software Engineering",
      "place": "NUML, Islamabad",
      "year": "'18"
    },
    {
      "title": "Collage",
      "degree": "FSC Pre-Engineering",
      "place": "Global Collage, Rawalpindi",
      "year": "'14"
    }
  ],
  "experience": [
    {
      "designation": "Development Consultant",
      "company": "TechVista Systems",
      "place": "Abu Dhabi, UAE",
      "description": "",
      "year": "2022 - Present"
    },
    {
      "designation": "Full Stack Engineer",
      "company": "ISSM.Ai",
      "place": "Blue Area, Islamabad",
      "description": "",
      "year": "2021 - Present"
    },
    {
      "designation": "Senior Software Design Engineer",
      "company": "Teresol",
      "place": "DHA, Islamabad",
      "description": "",
      "year": "2018 - 2021"
    }
  ],
  "skills": [
    "JavaScript",
    "Express",
    "ReactJs",
    "NextJs",
    "Redux",
    "React Query",
    "HTML/CSS",
    "SASS",
    "MapBox",
    "Google Maps",
    "Full Calendar",
    "PubNub",
    "framer-motion",
    "Chakra-Ui",
    "Ant Design",
    "Docker",
    "Docker-compose",
    "Kafka",
    "Agenda-JS",
    "Restful api",
    "Storybook",
    "C/C++",
    "Qt",
    "QGIS",
    "GDAL",
    "Mongodb",
    "MySQL",
    "SQLite",
    "Redis",
    "Ubuntu",
    "Raspbian",
    "L4T",
    "Jira",
    "Trello",
    "Github",
    "Gitlab"
  ],
  "projects": [
    {
      "name": "TAMM Project",
      "description": "TAMM allows users to use all government services using a single platform. Basically it’s the integration of all the government services to a single point of access. Government services like Housing & Properties, Drive & Transport, License, Vehicles, Traffic and Driving Services, Emirati Benefits, Culture and tourism, Work and Education, ZHO all are integrated into this project.",
      "link": "https://www.tamm.abudhabi/"
    },
    {
      "name": "Business 360",
      "description": "Business 360 is a microservice architecture based comprehensive system with a wide range of features including FSM, CRM, MRP, order dispatching and tracking, service creation, provision and tracking, creating and sales analytics.",
      "link": "https://vp.sublo.co/"
    },
    {
      "name": "Sublo",
      "description": "Sublo is a service provision platform. It provides vendors a platform to showcase their products and services to the consumer marketplace. Consumers can place orders, quote prices, schedule orders and track order",
      "link": "http://web.sublo.co/store/bbb"
    },
    {
      "name": "Workcycle",
      "description": "A system which allows the small businesses to manage their day-to-day sale, manage their inventory and procurement. Integration of web platform with fingerprint scanner for biometric attendance system. A configureale POS system to meet the business needs.",
      "link": "https://workcycle.co/"
    },
    {
      "name": "NIFT EPayment",
      "description": "NIFT epay is an online payment platform, this project allows integration of NIFT ePay gateway with core banking system using micro-service architecture. Micro-services are responsible for validating users, generating OTP, and transferring funds from user account to respective bank account.",
      "link": ""
    },
    {
      "name": "1Link",
      "description": "1Link is a payment gateway for PSW (Pakistan Single Window), 1link service allows the user of PSW to process their financial transaction using PSW portal. This project integrates 1link with core banking system to perform financial transactions into core banking system.",
      "link": ""
    },
    {
      "name": "LG Option",
      "description": "LG option allows the user to create a letter of guarantee for the users,it is one of the key features of the core banking application of Bank Alhabib. LG option validates user’s account conditions and generate LG for trading.",
      "link": ""
    },
    {
      "name": "DMP",
      "description": "DMP is a digital map processing application for air crafts, which displays tactical raster maps, vector maps, geo-strategic vector layers and geographical information on MFD (Multi-functional Display), that assist the pilot during the flight, in real-time. Another key feature of this application is to generate critical warnings for pilots,  based on the altitude of the aircraft. Basically, it scans the height of the area ahead of the aircraft from DEM ( Digital Elevation Models) and generates critical warnings based on current altitude.The application is developed using Qt C++ framework for NVIDIA Jetson TK1 development kit.",
      "link": ""
    },
    {
      "name": "CDU",
      "description": "CDU (Control Display Unit) is a configuration unit present in aircrafts which keeps the count of weapons, missiles, fuel and also performs system testing of the aircraft's various modules.",
      "link": ""
    },
    {
      "name": "Air-bill",
      "description": "Air-bill is an aircraft booking and scheduling website. The main purpose of the site is to show the available and booked slots on a fully interactive calendar, which also allows the users to book flights on the empty slots. Notify users with an automatically generated mail in case of a flight delay, or maintenance issues.",
      "link": ""
    },
    {
      "name": "React Resume Website Template",
      "description": "Built a React-based resume website template to allow other developers to download and create their own resume website by simply modifying a config file.",
      "link": "https://github.com/dork7/cv-template-react"
    }
  ]
}